case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    mesh;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         snappyHexMesh;

deltaT              1;

endTime             1000;

purgeWrite          0;

runTimeModifiable   yes;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

writeControl        timeStep;

writeFormat         ascii;

writeInterval       100;

writePrecision      15;

libs
(
    "libdecompositionMethods.so" "libscotchDecomp.so"
);

functions
{
    forces_turbine
    {
        type            forces;
        libs            (forces);
        patches         (turbine);
        rho             rhoInf;
        rhoInf          1.225;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            (0.447465 -3.022715 105.05);
    }

    vorticity
    {
        type            vorticity;
        libs            (fieldFunctionObjects);
	log             true;
	executeControl  writeTime;
        writeControl    writeTime;
    }

    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        timeStart       100;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            k
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

    relativeVelocity
    {
        type            MRFVelocity; // Correct type for v2406 MRF visualization
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

	turbineProbe
    {
        type            probes;
        libs            (sampling);
        // This extracts the data at every time step
        writeControl    timeStep;
        writeInterval   1;
        // The field you want to monitor
        fields          (U);
        // THE COORDINATES: Change these to your turbine's center!
        // Based on your bounding box: x=0, y=0, z=101.5 (1.5m above roof)
        probeLocations
        (
            (0 0 101.5)
        );
    }
}

// ************************************************************************* //
