case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile

{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 0 -1 0 0 0 0];



internalField   uniform 1.50; 



boundaryField

{

    "tunnel_walls_patch_1_0"   // Inlet - ABL log-law omega profile
    {
        type            atmBoundaryLayerInletOmega;
        flowDir         (0 1 0);
        zDir            (0 0 1);
        Uref            10.0;
        Zref            100.0;
        z0              uniform 0.5;
        d               uniform 0.0;
        kappa           0.41;
        Cmu             0.09;
        value           $internalField;
    }

    "tunnel_walls_patch_4_0" { type zeroGradient; }

    "(tunnel_walls_patch_2_0|tunnel_walls_patch_3_0|tunnel_walls_patch_6_0)"   // Sides/top
    {
        type            symmetry;
    }

    "tunnel_walls_patch_0_0"   // Ground - rough wall matching inlet z0
    {
        type            atmOmegaWallFunction;
        z0              uniform 0.5;
        value           $internalField;
    }

    "(turbine|pole)"

    {

        type            omegaWallFunction;

        value           $internalField;

    }

} 