case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }
}

/*
SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes;
    pRefPoint       (-50 -50 50); // A point high in the air, away from objects
    pRefValue       0;
    
    residualControl
    {
        p               1e-4;
        U               1e-4;
    }
}
*/

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent yes;
    pRefPoint       (-50 -50 50); // A point high in the air, away from objects
    pRefValue       0;
    residualControl
    {
        p           1e-3;
        U           1e-4;
        k           1e-4;
        omega       1e-4;
    }
}

relativeConvergence
{
    p           0.05;
    U           0.05;
    k           0.05;
    omega       0.05;
}

relaxationFactors
{
    fields
    {
        p               0.2;
    }
    equations
    {
        U               0.3;
        k               0.5;
        omega           0.5;
    }
}
// ************************************************************************* //
