case/system/rotorDiskSample
/*--------------------------------*- C++ -*----------------------------------*\
  Rotor-disk sampling for baseline scenario.
  116 points, radius 1.65 m - matches the confirmed H-rotor blade-tip
  radius (constant with height, verified from turbine_final.stl vertex data).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object rotorDiskSample;
}

type            sets;
libs            (sampling);

writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;

sets
(
    rotorDisk
    {
        type    cloud;
        axis    xyz;
        points
        (
            (0.44747 -3.02271 105.05000)
            (0.65372 -3.02271 105.05000)
            (0.59331 -3.02271 105.19584)
            (0.44747 -3.02271 105.25625)
            (0.30162 -3.02271 105.19584)
            (0.24122 -3.02271 105.05000)
            (0.30162 -3.02271 104.90416)
            (0.44746 -3.02271 104.84375)
            (0.59331 -3.02271 104.90416)
            (0.85996 -3.02271 105.05000)
            (0.73915 -3.02271 105.34168)
            (0.44747 -3.02271 105.46250)
            (0.15578 -3.02271 105.34168)
            (0.03497 -3.02271 105.05000)
            (0.15578 -3.02271 104.75832)
            (0.44746 -3.02271 104.63750)
            (0.73915 -3.02271 104.75832)
            (1.06621 -3.02271 105.05000)
            (0.92145 -3.02271 105.44772)
            (0.55491 -3.02271 105.65935)
            (0.13809 -3.02271 105.58585)
            (-0.13397 -3.02271 105.26162)
            (-0.13397 -3.02271 104.83838)
            (0.13809 -3.02271 104.51415)
            (0.55491 -3.02271 104.44065)
            (0.92145 -3.02271 104.65228)
            (1.27246 -3.02271 105.05000)
            (1.16194 -3.02271 105.46250)
            (0.85997 -3.02271 105.76447)
            (0.44747 -3.02271 105.87500)
            (0.03497 -3.02271 105.76447)
            (-0.26701 -3.02271 105.46250)
            (-0.37753 -3.02271 105.05000)
            (-0.26701 -3.02271 104.63750)
            (0.03496 -3.02271 104.33553)
            (0.44746 -3.02271 104.22500)
            (0.85997 -3.02271 104.33553)
            (1.16194 -3.02271 104.63750)
            (1.47872 -3.02271 105.05000)
            (1.38956 -3.02271 105.46945)
            (1.13751 -3.02271 105.81637)
            (0.76614 -3.02271 106.03078)
            (0.33967 -3.02271 106.07560)
            (-0.06816 -3.02271 105.94309)
            (-0.38683 -3.02271 105.65615)
            (-0.56125 -3.02271 105.26441)
            (-0.56125 -3.02271 104.83559)
            (-0.38683 -3.02271 104.44385)
            (-0.06816 -3.02271 104.15691)
            (0.33967 -3.02271 104.02440)
            (0.76614 -3.02271 104.06922)
            (1.13751 -3.02271 104.28363)
            (1.38956 -3.02271 104.63055)
            (1.68496 -3.02271 105.05000)
            (1.61033 -3.02271 105.47325)
            (1.39544 -3.02271 105.84545)
            (1.06622 -3.02271 106.12171)
            (0.66235 -3.02271 106.26870)
            (0.23258 -3.02271 106.26870)
            (-0.17128 -3.02271 106.12171)
            (-0.50051 -3.02271 105.84545)
            (-0.71540 -3.02271 105.47325)
            (-0.79003 -3.02271 105.05000)
            (-0.71540 -3.02271 104.62675)
            (-0.50051 -3.02271 104.25455)
            (-0.17129 -3.02271 103.97829)
            (0.23258 -3.02271 103.83130)
            (0.66235 -3.02271 103.83130)
            (1.06621 -3.02271 103.97829)
            (1.39544 -3.02271 104.25455)
            (1.61033 -3.02271 104.62675)
            (1.89121 -3.02271 105.05000)
            (1.82707 -3.02271 105.47555)
            (1.64035 -3.02271 105.86329)
            (1.34763 -3.02271 106.17877)
            (0.97493 -3.02271 106.39395)
            (0.55536 -3.02271 106.48971)
            (0.12620 -3.02271 106.45755)
            (-0.27441 -3.02271 106.30032)
            (-0.61088 -3.02271 106.03200)
            (-0.85331 -3.02271 105.67642)
            (-0.98016 -3.02271 105.26518)
            (-0.98016 -3.02271 104.83482)
            (-0.85331 -3.02271 104.42358)
            (-0.61088 -3.02271 104.06800)
            (-0.27441 -3.02271 103.79968)
            (0.12620 -3.02271 103.64245)
            (0.55536 -3.02271 103.61029)
            (0.97493 -3.02271 103.70605)
            (1.34763 -3.02271 103.92123)
            (1.64035 -3.02271 104.23671)
            (1.82707 -3.02271 104.62445)
            (2.09746 -3.02271 105.05000)
            (2.04124 -3.02271 105.47705)
            (1.87641 -3.02271 105.87500)
            (1.61419 -3.02271 106.21673)
            (1.27247 -3.02271 106.47894)
            (0.87452 -3.02271 106.64378)
            (0.44747 -3.02271 106.70000)
            (0.02041 -3.02271 106.64378)
            (-0.37753 -3.02271 106.47894)
            (-0.71926 -3.02271 106.21673)
            (-0.98148 -3.02271 105.87500)
            (-1.14631 -3.02271 105.47705)
            (-1.20253 -3.02271 105.05000)
            (-1.14631 -3.02271 104.62295)
            (-0.98148 -3.02271 104.22500)
            (-0.71926 -3.02271 103.88327)
            (-0.37754 -3.02271 103.62106)
            (0.02041 -3.02271 103.45622)
            (0.44746 -3.02271 103.40000)
            (0.87452 -3.02271 103.45622)
            (1.27247 -3.02271 103.62106)
            (1.61419 -3.02271 103.88327)
            (1.87641 -3.02271 104.22500)
            (2.04124 -3.02271 104.62295)
        );
    }
);

fields          (UMean kMean);

// ***********************************************************************  //
